# 赋值运算符
# 执行顺序：右--->左
# 支持链式赋值：a=b=c=20
# 支持参数赋值：+=、-=、*=、/=、//=、%=
# 支持系列解包赋值：a,b,c=20,30,40

# 赋值运算符，运算顺序从右到左
i = 3 + 4  # 先计算3+4，然后再把结果赋给a
print(i)

print('------------链式赋值------------')
a = b = c = 20
print(a, id(a))
print(b, id(b))
print(c, id(c))

print('------------支持参数赋值------------')
a = 20
a += 30  # 即 a=a+30 (运算顺序是自右而左）
print(a)
a -= 10  # 即a=a-10 (运算顺序是自右而左）
print(a)
a *= 2  # 即a=a*2 (运算顺序是自右而左）
print(a, type(a))
a /= 3
print(a, type(a))
a //= 2
print(a, type(a))
a %= 3
print(a)

print('------------支持系列解包赋值------------')
a, b, c = 20, 30, 40
print(a, b, c)

# a,b=20,30,40   #会报错，因为左边变量的个数和右边值得个数不对应

print('------------交换两个变量的值------------')
a, b = 10, 20
print('交换之前：', a, b)
# 交换
a, b = b, a
print('交换之后：', a, b)
# 以上的交换操作如果用C语言会需要中间值，而需要更多的代码
